benchmark/results/run_20260123_141603/medium_file.txt
Running 30s test @ http://127.0.0.1:8080/static/medium.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.67ms    7.88ms  80.21ms   35.45%
    Req/Sec     2.95k   191.63     3.38k    76.42%
  Latency Distribution
     50%    9.14ms
     75%   16.35ms
     90%   17.45ms
     99%   19.39ms
  352075 requests in 30.02s, 3.36GB read
Requests/sec:  11728.89
Transfer/sec:    114.55MB