benchmark/results/run_20260123_141603/small_file.txt
Running 30s test @ http://127.0.0.1:8080/static/index.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.10ms    7.36ms  24.06ms   29.67%
    Req/Sec     3.12k   151.89     3.50k    77.42%
  Latency Distribution
     50%    8.57ms
     75%   15.51ms
     90%   16.24ms
     99%   18.15ms
  372916 requests in 30.01s, 78.06MB read
Requests/sec:  12426.67
Transfer/sec:      2.60MB